export default function Footer() {
  return (
    <footer className="bg-[#1d1d1f] text-white">
      <div className="max-w-screen-lg mx-auto px-4 py-4">
        <section className="text-[11px] font-light text-[#ffffff8f] grid gap-2">
          <ul className="grid gap-2">
            <li>
              ◊ ‘개인 음성’은 Apple Silicon을 탑재한 iPhone, iPad, Mac에서
              생성할 수 있으며, 모든 지역에서 영어로만 지원됩니다.
            </li>
            <li>
              * ₩990,000은 iPhone 14 Pro Max 1TB 모델의 보상 판매 금액으로, 보상
              판매 프로그램은 Apple의 파트너이자 독립적으로 운영되는 제3의
              업체에 의해 제공됩니다. Apple 및 Apple의 계열사는 고객과 파트너 간
              계약의 당사자가 아닙니다. 보상 판매 견적은 예상 금액이며 실제 보상
              판매 금액은 예상 금액보다 낮을 수 있습니다. 보상 판매 금액은 보상
              판매 대상이 되는 제품의 상태, 연도, 구성에 따라 달라집니다. 일부
              기기는 보상 판매 대상이 아닙니다. 기기를 보상 판매 하려면 민법상
              성년이어야 합니다. 보상 판매 금액은 적용 가능한 새 기기 구입 시
              적용하거나 Apple Store Gift Card로 받을 수 있습니다. 최종 확정
              금액은 보상 판매 대상 기기를 수령한 후, 예상 금액 산정 시 제시한
              기기의 설명과 일치하는지 비교 검수 후 정해집니다. 부가세는 새로
              구입한 기기의 총액을 바탕으로 부과됩니다. 일부 매장에서는 보상
              판매를 제공하지 않으며, 매장 내 보상 판매와 온라인 보상 판매
              프로그램 간 내용에 차이가 있을 수 있습니다. 일부 매장은 추가 요구
              사항이 있을 수 있습니다. Apple의 보상 판매 파트너는 보상 판매
              거래를 거부, 취소하거나 보상 판매 수량을 제한할 권리를 보유합니다.
              적용 가능 기기의 보상 판매 및 재활용에 대한 자세한 내용은 Apple의
              보상 판매 파트너사에서 확인할 수 있습니다. 규제 및 제한이 적용될
              수 있습니다.
            </li>
            <ol className="list-decimal grid gap-2 pl-4">
              <li>
                디스플레이 크기: 디스플레이는 모서리가 둥근 형태로, 기기의
                아름다운 곡면 디자인을 반영합니다. 이 모서리는 기기의 전체적인
                모양인 직사각형 내부에 위치합니다. 직사각형 기준으로 측정했을
                때, iPhone 15 Pro 화면은 대각선 길이 기준 15.54cm, iPhone 15 Pro
                Max는 17.00cm입니다. 실제로 보이는 영역은 이보다 좁습니다.
              </li>
              <li id="footnote-2">
                iPhone 15 Pro 및 iPhone 15 Pro Max는 IEC 규격 60529하의 IP68
                등급 생활 방수(최대 수심 6m, 최대 30분) 및 방진 기능을 갖추고
                있습니다. 제어된 실험실 조건에서 진행된 테스트 결과입니다. 생활
                방수 및 방진 효과는 영구적이지 않으며 제품이 자연스럽게 마모됨에
                따라 그 효과가 약해질 수 있습니다. iPhone이 물에 젖어 있을 때
                충전을 시도하지 마십시오. 청소 및 건조 방법은 사용 설명서를
                참고하십시오. 액체에 의한 손상은 보증 대상이 아닙니다.
              </li>
              <li>스탠드는 별도로 판매됩니다.</li>
              <li>10Gb/s 속도를 지원하는 USB 3 케이블이 필요합니다.</li>
              <li>
                Wi‑Fi 6E는 지원되는 국가 및 지역에서만 이용할 수 있습니다.
              </li>
              <li>
                기본 포함된 USB‑C 충전 케이블은 AirPods Pro MagSafe 충전 케이스
                모델(2세대, USB‑C)과 호환됩니다.
              </li>
              <li>
                테스트는 2023년 8월 Apple에서 시제품 iPhone 15, iPhone 15 Plus,
                iPhone 15 Pro, iPhone 15 Pro Max 및 소프트웨어 그리고 액세서리인
                Apple USB‑C 전원 어댑터(20W 모델 A2305)를 사용해 진행했습니다.
                급속 충전 테스트는 완전히 방전된 iPhone 기기를 사용해
                진행했습니다. 충전 시간은 설정 및 여러 환경 요인에 따라
                다릅니다. 실제 사용 결과는 다를 수도 있습니다.
              </li>
              <li>
                eSIM을 사용하려면 무선 네트워크 서비스 요금제에 가입해야 하며,
                약정 요금제에 가입할 경우 약정이 종료된 후에도 이동통신사 및
                로밍 변경이 제한될 수 있습니다. 일부 이동통신사는 eSIM을
                지원하지 않습니다. 특정 이동통신사에서 구입한 iPhone은 eSIM
                사용이 불가능할 수 있습니다. 자세한 내용은 해당 이동통신사의
                안내를 참고하십시오. eSIM에 관한 자세한 내용은 apple.com/esim을
                참고하십시오.
              </li>
              <li>
                데이터 요금제에 가입해야 합니다. 5G는 일부 국가에서 일부
                이동통신사를 통해 사용 가능합니다. 속도는 장소 및 이동통신사에
                따라 다를 수 있습니다. 5G 지원에 대한 자세한 내용은 이동통신사에
                문의하거나 apple.com/kr/iphone/cellular를 참고하십시오.
              </li>
              <li>
                모든 배터리는 네트워크 구성 및 기타 여러 요인에 따라 소모되는
                정도가 다릅니다. 실제 결과는 다를 수 있습니다. 배터리는 충전
                사이클이 제한되어 있으므로 추후 교체해야 할 수도 있습니다.
                배터리 사용 시간과 충전 사이클은 사용 방법 및 설정에 따라
                다릅니다. 자세한 내용은 apple.com/kr/batteries 및
                apple.com/kr/iphone/battery.html을 참고하십시오.
              </li>
              <li>액세서리는 별도로 판매됩니다.</li>
              <li>
                iPhone 15 및 iPhone 15 Pro는 심각한 자동차 충돌 사고 발생 시
                이를 감지해 구조 요청을 해줄 수 있습니다. 셀룰러 연결이
                필요합니다.
              </li>
              <li>
                질량 균형 할당(mass balance allocation) 방식에 의한 결과입니다.
              </li>
              <li>
                미국 리테일 포장재의 세부 명세표에 표기된 무게를 기준으로 한
                수치입니다. 접착제, 잉크, 코팅제는 플라스틱 포함량 및 포장재
                무게 계산 시 제외됩니다.
              </li>
              <li>
                펄프의 책임감 있는 조달은 Apple의 책임감 있는 펄프
                명세서(Responsible Fiber Specification)에 정의되어 있습니다.
                우리는 대나무도 펄프로 간주합니다.
              </li>
              <li>
                ‘문 감지’ 및 ‘가리키면 읽어주기’ 기능은 한국어(대한민국),
                광둥어(간체, 번체), 중국어(간체, 번체), 영어(미국),
                프랑스어(프랑스), 독일어(독일), 이탈리아어(이탈리아),
                일본어(일본), 포르투갈어(브라질), 러시아어(러시아),
                스페인어(스페인), 우크라이나어(우크라이나)로 표기된 표지판 및
                라벨을 읽을 수 있습니다. 상해 및 부상을 당할 수 있거나, 고위험
                또는 응급 상황인 경우 ‘감지 모드’에 의존해서는 안 됩니다.
              </li>
              <li>
                2세대 초광대역 칩을 탑재한 iPhone 및 Apple Watch가 필요합니다.
                초광대역 기술의 사용 가능 여부는 국가에 따라 다릅니다.
              </li>
              <li>
                배터리 사용 시간은 더 큰 사이즈 모델 기준입니다. 모든 배터리는
                네트워크 구성 및 기타 여러 요인에 따라 소모되는 정도가 다릅니다.
                실제 결과는 다를 수 있습니다. 배터리는 충전 사이클이 제한되어
                있으므로 추후 교체해야 할 수도 있습니다. 배터리 사용 시간과 충전
                사이클은 사용 방법 및 설정에 따라 다릅니다. 자세한 내용은
                apple.com/kr/batteries 및 apple.com/kr/iphone/battery.html을
                참고하십시오.
              </li>
            </ol>
            <li>
              앱은 App Store에서 다운로드할 수 있습니다. 각 앱의 출시 여부는
              변경될 수 있습니다.
            </li>
            <li>Apple TV+ 이용을 위해서는 가입이 필요합니다.</li>
          </ul>
        </section>
      </div>
    </footer>
  );
}
